src/DataProcessors/МониторRAC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторRAC</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ксКластеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксКластеры</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>host</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expirationTimeout</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lifetimeLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>maxMemorySize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>maxMemoryTimeLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>securityLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sessionFaultToleranceLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>loadBalancingMode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>errorsCountThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>killProblemProcesses</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>killByMemoryWithDump</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>cluster</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксИндикаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксИндикаторы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Желтый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Красный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Список</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/зд_АктуальнаяПлатформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>зд_АктуальнаяПлатформа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.здПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксИнформационныеБазы</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>descr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>infobase</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/МониторRAC/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем СтарыеКолонки; 
&НаКлиенте
Перем СоответсвиеСинонимовСвойств;



&НаКлиенте
Процедура ПолучитьДанные(Команда)
	СформироватьСписокНаКлиенте(Список);
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьСписокНаКлиенте(list)
	
	ТекущиеДанные = Элементы.ТаблицаКластеров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// сбросим флаг текущий
	Для каждого стр из ТаблицаКластеров Цикл
		стр.current = Ложь;
	КонецЦикла;
	
	ТекущиеДанные.current = Истина;
	//ДатаОбновления = ТекущаяДата();
	
	//Если НеИспользоватьФоновоеОбновлениеДанных=Истина Тогда	
	//	
		мПараметры = СформироватьСтруктуруЗапроса(ТекущиеДанные);
	
		СтруктураДанныхОтвета = ПолучитьСписок(мПараметры,list);
		СтруктураДанныхОтвета.Вставить("list",list);
		СтруктураДанныхОтвета.Вставить("cluster",мПараметры.cluster);
		
		ОбработатьОтображениеДанных(СтруктураДанныхОтвета);
	//Иначе
	//	
	//	ОбновитьДанныеФоново(ТекущиеДанные);
	//	
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ИмяКолонкиСортировки = "";  
	ЗаполнитьТаблицаАгрегацииДанных(Список);

//	Если Элементы.КартинкаИстория.Видимость = Ложь Тогда
		СформироватьСписокНаКлиенте(Список);
//	Иначе
		//ОбновитьТаблицуДаннымиИзИстории("без изменений");
//	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СоответсвиеСинонимовСвойств = ПолучитьСоответсвиеСинонимовСвойств();
	//ЗагрузитьНастройки(Неопределено);
	Если НЕ ЗначениеЗаполнено(Список) Тогда
		Список="ксСеансы";
	КонецЕсли;
	//Элементы.Список.СписокВыбора.Добавить("infobase","инф. базы");
	//Элементы.Список.СписокВыбора.Добавить("server","сервера");
	//Элементы.Список.СписокВыбора.Добавить("manager","менеджеры");
	Элементы.Список.СписокВыбора.Добавить("ксПроцессы","процессы");
	//Элементы.Список.СписокВыбора.Добавить("process licenses","проц. лиц.");
	Элементы.Список.СписокВыбора.Добавить("ксСоединения","соединения");
	Элементы.Список.СписокВыбора.Добавить("ксСеансы","сеансы");
	//Элементы.Список.СписокВыбора.Добавить("session licenses","сеансы лиц.");
//	ПоляТаблицыДанных(Неопределено);
	
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*25,"1 д 1ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*24,"1 д");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*12,"12 ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*6,"6 ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*3,"3 ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*2,"2 ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60*1.5,"1 ч 30 мин");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*60,"1 ч");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*30,"30 мин");
	Элементы.ИнтервалИстории.СписокВыбора.Добавить(60*15,"15 мин");
	
	Если НЕ ЗначениеЗаполнено(ИнтервалИстории) Тогда
		ИнтервалИстории = 60*60*2;
	КонецЕсли; 
	
	СтарыеКолонки = новый Массив;
	
	СоздатьИОбновитьКолонкиПустыеКолонки();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицаКластеров();
	ЗаполнитьТаблицаАгрегацииДанных("ксСеансы");
	ЗаполнитьДатуОбновления("", "ксСеансы");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицаКластеров()
	
	ТаблицаКластеров.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксКластеры.cluster КАК cluster,
		|	ксКластеры.host КАК host,
		|	ксКластеры.port КАК port,
		|	ксКластеры.name КАК name,
		|	ксКластеры.Кластер КАК key
		|ИЗ
		|	РегистрСведений.ксКластеры КАК ксКластеры";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = ТаблицаКластеров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицаАгрегацииДанных(Список)
	
	ТаблицаАгрегацииДанных.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Список КАК Список,
		|	Т.Свойство КАК Свойство,
		|	Т.Функция КАК Функция,
		|	Т.Синоним КАК Синоним,
		|	Т.Желтый КАК Желтый,
		|	Т.Красный КАК Красный
		|ИЗ
		|	РегистрСведений.ксИндикаторы КАК Т
		|
		|ГДЕ
		|	Т.Список = &Список";
	
	Запрос.УстановитьПараметр("Список", Список);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = ТаблицаАгрегацииДанных.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьДатуОбновления(Кластер = "", list)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MAX(Т.ПериодЗаписи) КАК ПериодЗаписи
		|ИЗ
		|	РегистрСведений." +list+" КАК Т
		|ГДЕ
		|	Т.Кластер = CASE WHEN &Кластер = """" THEN Т.Кластер ELSE &Кластер END";
	
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаОбновления = ВыборкаДетальныеЗаписи.ПериодЗаписи;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКластеровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СформироватьСписокНаКлиенте(Список);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКластеровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СформироватьСписокНаКлиенте(Список);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГрафик(Команда)
	ОбновитьГрафикИстории();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГрафикИстории()
	
	ТекущиеДанные = Элементы.ТаблицаАгрегацииДанных.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновитьГрафикИсторииСервер(Список,ТекущиеДанные.Свойство,ТекущиеДанные.Синоним,ТекущиеДанные.Функция,КлючКластера, ТекущиеДанные.Желтый, ТекущиеДанные.Красный);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГрафикИсторииСервер(ТипСобытия,name,synonim,func,key, Желтый, Красный)
	
	ДатаСобытия = ДатаОбновления;
	Если ДатаСобытия=Дата(1,1,1) Тогда
		ДатаСобытия = ТекущаяДата();
	КонецЕсли;

	Свойство = synonim;
	
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы=ТипДиаграммы.График;
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Низ;
	
	Запрос = новый Запрос;
	
	Если func = "count ЗначениеЗаполнено" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	""" + synonim + """ КАК Свойство,
		|	count(Т." + name + ") КАК ЗначениеЧисло,
		|	Т.ПериодЗаписи КАК ДатаСобытия
		|ИЗ
		|	РегистрСведений." + ТипСобытия + " КАК Т
		|ГДЕ
		|	Т.ПериодЗаписи МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Т.Кластер = &Кластер
		|	И Т." + name + " <> 0
		|GROUP BY Т.ПериодЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытия";	

	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	""" + synonim + """ КАК Свойство,
		|	"+func+"(Т." + name + ") КАК ЗначениеЧисло,
		|	Т.ПериодЗаписи КАК ДатаСобытия
		|ИЗ
		|	РегистрСведений." + ТипСобытия + " КАК Т
		|ГДЕ
		|	Т.ПериодЗаписи МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Т.Кластер = &Кластер  
		|GROUP BY Т.ПериодЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытия";	
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаСобытия-ИнтервалИстории);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаСобытия);
	// кластер
	Запрос.УстановитьПараметр("Кластер", key);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СерияОкно = Диаграмма.УстановитьСерию(Свойство);
	СуждениеЦветоваяИндикация = Неопределено;
	Если Желтый > 0 ИЛИ Красный > 0 Тогда 
		СуждениеЦветоваяИндикация = Новый Соответствие;
		СуждениеЦветоваяИндикация.Вставить("Желтый", Желтый);
		СуждениеЦветоваяИндикация.Вставить("Красный", Красный);	
	КонецЕсли;

	Если НЕ СуждениеЦветоваяИндикация = Неопределено Тогда
		СерияЖелтый = Диаграмма.УстановитьСерию("Желтый");
		СерияЖелтый.Цвет = Новый Цвет(249,166,2);
		СерияКрасный = Диаграмма.УстановитьСерию("Красный");
		СерияКрасный.Цвет = Новый Цвет(255,100,100);
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		
		ТочкаДиаграммы = Диаграмма.УстановитьТочку(Выборка.ДатаСобытия);
			
		// добавим значение	
		Диаграмма.УстановитьЗначение(ТочкаДиаграммы, СерияОкно, Выборка.ЗначениеЧисло);
		
		Если НЕ СуждениеЦветоваяИндикация = Неопределено Тогда
			ЗначениеЧисло = СуждениеЦветоваяИндикация.Получить("Желтый");
			Диаграмма.УстановитьЗначение(ТочкаДиаграммы, СерияЖелтый, ЗначениеЧисло);
			ЗначениеЧисло = СуждениеЦветоваяИндикация.Получить("Красный");
			Диаграмма.УстановитьЗначение(ТочкаДиаграммы, СерияКрасный, ЗначениеЧисло);
		КонецЕсли;
		
	КонецЦикла;
	 	
КонецПроцедуры


&НаКлиенте
Функция СформироватьСтруктуруЗапроса(Знач ТекущиеДанные)
	
	мПараметры = новый Структура();
	//мПараметры.Вставить("ПутьКИсполняемомуФайлуRAC",ПутьКИсполняемомуФайлуRAC);
	//мПараметры.Вставить("КодировкаТекстаФайла",КодировкаТекстаФайла);
	Если НЕ ТекущиеДанные=Неопределено Тогда
		мПараметры.Вставить("host",ТекущиеДанные.host);
		мПараметры.Вставить("port",ТекущиеДанные.port);
		мПараметры.Вставить("cluster",ТекущиеДанные.cluster);
	//	мПараметры.Вставить("cluster_user",ТекущиеДанные.cluster_user);
	//	мПараметры.Вставить("cluster_pwd",ТекущиеДанные.cluster_pwd);
	//	cluster = ТекущиеДанные.cluster;
	Иначе
		мПараметры.Вставить("host","");
		мПараметры.Вставить("port",1541);
		мПараметры.Вставить("cluster","");
	//	мПараметры.Вставить("cluster_user","");
	//	мПараметры.Вставить("cluster_pwd","");
	//	cluster = "";
	КонецЕсли;
	
	КлючКластера = ТекущиеДанные.key;

	Возврат мПараметры;

КонецФункции

&НаКлиенте
Процедура ПерейтиКПервойСтроке(Команда)
	Если ТаблицаДанных.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаДанных.ТекущаяСтрока = ТаблицаДанных[0].ПолучитьИдентификатор();
КонецПроцедуры 

&НаКлиенте
Процедура СортироватьТаблицуДанных(ИмяКолонки,Направление="Возр")
	
	Если ИмяКолонки="" Тогда
		Элемент = Элементы.ТаблицаДанных.ТекущийЭлемент;
		Если Элемент=Неопределено Тогда
			Возврат;
		КонецЕсли;
		ИмяКолонки = СтрЗаменить(Элемент.Имя,"ТаблицаДанных","");
		ИмяКолонкиСортировки = ИмяКолонки+" "+Направление;
	КонецЕсли;
	
	Попытка
		ТаблицаДанных.Сортировать(ИмяКолонкиСортировки);
	Исключение
		// сбросим если нет сортировки
		ИмяКолонкиСортировки = "";
	КонецПопытки;
		
КонецПроцедуры


&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	СортироватьТаблицуДанных("","Убыв");
КонецПроцедуры


&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	СортироватьТаблицуДанных("","Возр");
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКПоследнейСтроке(Команда)
	Если ТаблицаДанных.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаДанных.ТекущаяСтрока = ТаблицаДанных[ТаблицаДанных.Количество()-1].ПолучитьИдентификатор();
КонецПроцедуры     

&НаКлиенте
Процедура СоздатьИОбновитьКолонкиПустыеКолонки()
	
	Перем ИмяКолонки, Колонки, КС, КЧ, МассивТипов, ОписаниеТипов, ОписаниеЧисло, стр, стр_н, ш, элем;
	
	Колонки = новый Массив;
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("Дата"));
	КС = Новый КвалификаторыСтроки(200);
	КЧ = Новый КвалификаторыЧисла(20,3);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , ,КЧ, КС);
	ОписаниеЧисло = Новый ОписаниеТипов("Число", , ,КЧ);	
	
	Колонки = новый массив;
	
	Колонки.Добавить(новый Структура("Имя,Ключ,ТипСтрокой,ТипЗначения,Ширина,Заголовок,ИмяКолонки,ИмяСледующегоЭлемента,ТолькоПросмотр,Видимость",
	"empty","empty","Строка",ОписаниеТипов,10,"пусто (обновите данные)","empty",Неопределено,Истина,Истина));

	// создадим динамически таблицу 
	Попытка
		СоздатьДинамическиеКолонкиТаблицы("ТаблицаДанных",Колонки,СтарыеКолонки);
	Исключение
	КонецПопытки;
	
	
	СтарыеКолонки = Колонки;
		
	ТаблицаДанных.Очистить();
	
КонецПроцедуры


&НаСервере
Процедура СоздатьДинамическиеКолонкиТаблицы(ИмяТаблицы,МассивСтруктурКолонок,МассивСтруктурТекущихКолонок,КромеИменКолонок="")
	
	МассивУдаляемыхЭлементов = новый Массив;
	МассивДобавляемыхЭлементов = новый Массив;
	
	Для каждого Колонка из МассивСтруктурТекущихКолонок Цикл
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		МассивУдаляемыхЭлементов.Добавить(ИмяТаблицы+"."+Колонка.Имя);
		Элементы.Удалить(Элементы[ИмяТаблицы+Колонка.Имя]);    
	КонецЦикла;   
	
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("ТаблицаЗначений"));           
	ОписаниеТиповТаблица = Новый ОписаниеТипов(МассивТипов);
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("Строка"));          
	ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов);
	
	Для каждого Колонка из МассивСтруктурКолонок Цикл
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		Если Колонка.ТипЗначения = ОписаниеТиповТаблица Тогда
			ОписаниеТипов = ОписаниеТиповСтрока;
		Иначе
			ОписаниеТипов = новый ОписаниеТипов(Колонка.ТипЗначения);
		КонецЕсли;
		НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, ОписаниеТипов, ИмяТаблицы, Колонка.Имя, Ложь);
		МассивДобавляемыхЭлементов.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Если МассивДобавляемыхЭлементов.Количество()=0 И МассивУдаляемыхЭлементов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхЭлементов,МассивУдаляемыхЭлементов);
	
	Для каждого Колонка из МассивСтруктурКолонок Цикл                       
		Если Найти(КромеИменКолонок,Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		СледующийЭлемент = Неопределено;
		Если НЕ Колонка.ИмяСледующегоЭлемента=Неопределено Тогда
			СледующийЭлемент = Элементы.Найти(Колонка.ИмяСледующегоЭлемента);
		КонецЕсли;
		НовыйЭлемент = Элементы.Вставить(Элементы[ИмяТаблицы].Имя+Колонка.Имя, Тип("Полеформы"), Элементы[ИмяТаблицы],СледующийЭлемент);
		Если Колонка.ТипСтрокой="Булево" Или  Колонка.ТипСтрокой="Boolean"Тогда
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		Иначе
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Высота = 0;
			НовыйЭлемент.Ширина = Колонка.Ширина;                
		КонецЕсли;
		НовыйЭлемент.Видимость = Колонка.Видимость;
		НовыйЭлемент.Доступность = Истина;
		НовыйЭлемент.ТолькоПросмотр = Колонка.ТолькоПросмотр;   
		НовыйЭлемент.Заголовок = Колонка.Заголовок;
		НовыйЭлемент.Подсказка = Колонка.Заголовок;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы+"."+Колонка.Имя;    
	КонецЦикла;
	
	
КонецПроцедуры   

&НаКлиенте	
Процедура ОбработатьОтображениеДанных(СтруктураДанныхОтвета)	

	Элементы.ДатаОбновления.ЦветФона = новый Цвет();

	list = СтруктураДанныхОтвета.list;
	cluster = СтруктураДанныхОтвета.cluster;
	
	Если list="infobase" Тогда
		СписокИнформационныхБаз = СтруктураДанныхОтвета.МассивСоответствиеДанных;
	КонецЕсли;	
	
	СоздатьИОбновитьКолонки(СтруктураДанныхОтвета.МассивСоответствиеДанных,list);
		
	ЗаполнитьТаблицуСвойств(СтруктураДанныхОтвета.МассивСоответствиеДанных,list);
	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьИОбновитьКолонки(Знач МассивСоответствиеДанных,Знач list)
	
	Перем ИмяКолонки, Колонки, КС, КЧ, МассивТипов, ОписаниеТипов, ОписаниеЧисло, стр, стр_н, ш, элем;
	
	Колонки = новый Массив;
	МассивТипов = новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Булево"));
	МассивТипов.Добавить(Тип("Дата"));
	КС = Новый КвалификаторыСтроки(200);
	КЧ = Новый КвалификаторыЧисла(20,3);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, , ,КЧ, КС);
	ОписаниеЧисло = Новый ОписаниеТипов("Число", , ,КЧ);	
	
	Колонки = новый массив;   
	
	// СоответсвиеИменКолонок
	СоответсвиеИменКолонок = Новый Соответствие;
	
	
	Для каждого элем из МассивСоответствиеДанных Цикл	
		
		ш=0;
		Для каждого стр из элем Цикл
			ИмяКолонки = "колонка_"+Формат(ш,"ЧГ=;");
			СоответсвиеИменКолонок.Вставить(стр.Ключ,ИмяКолонки);
			Заголовок = стр.Ключ;
			Описание = СоответсвиеСинонимовСвойств.Получить(list+"/"+Заголовок);
			Если НЕ Описание=Неопределено Тогда
				Заголовок = Описание.Синоним;
			КонецЕсли;
			Колонки.Добавить(новый Структура("Имя,Ключ,ТипСтрокой,ТипЗначения,Ширина,Заголовок,ИмяКолонки,ИмяСледующегоЭлемента,ТолькоПросмотр,Видимость",ИмяКолонки,стр.Ключ,Строка(ТипЗнч(стр.Значение)),ОписаниеТипов,10,Заголовок,ИмяКолонки,Неопределено,Истина,Истина));
			ш=ш+1;
		КонецЦикла;
		прервать;
		
	КонецЦикла;
	
	// проверим на отличие колонок
	// если тот же список, то менять не надо
	Если НЕ СоставКолонокОдинаковый(Колонки, СтарыеКолонки) = Истина Тогда
	
		ПолучитьНастройкиКолонокТекущегоСписка(Колонки, list);
	
		// создадим динамически таблицу 
		Попытка
			СоздатьДинамическиеКолонкиТаблицы("ТаблицаДанных", Колонки, СтарыеКолонки);
		Исключение
		КонецПопытки;
	
		УстановитьУсловноеОформлениеТаблицыДанных(Колонки,list);
		
		СтарыеКолонки = Колонки;
	
	КонецЕсли;
			
	ТаблицаДанных.Очистить();
	источник = новый структура("name,value,func,decision","",0,"","");
	
	Для каждого элем из МассивСоответствиеДанных Цикл
		стр_н = ТаблицаДанных.Добавить();
		источник.decision="";
		ИмяКолонки_decision = Неопределено;
		ш=0;
		Для каждого стр из элем Цикл  
			ИмяКолонки = СоответсвиеИменКолонок.Получить(стр.Ключ);
			Если ИмяКолонки=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			стр_н[ИмяКолонки]=стр.Значение;
			ш=ш+1;
			источник.name = стр.Ключ;
			источник.value = стр.Значение;
			УстановитьУровеньПроблемыСтроки(источник);
			Если стр.Ключ="decision" Тогда
				ИмяКолонки_decision = ИмяКолонки;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ИмяКолонки_decision=Неопределено Тогда 
			стр_н[ИмяКолонки_decision] = источник.decision;
		КонецЕсли;
	КонецЦикла;

	СортироватьТаблицуДанных(ИмяКолонкиСортировки,);
	//Элементы.Декорация1.Видимость = ТаблицаДанных.Количество()=0;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответсвиеСинонимовСвойств()
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Возврат РеквизитОбъект.ПолучитьПолноеСоответствиеСвойств();
КонецФункции 

&НаКлиенте
Процедура УстановитьУровеньПроблемыСтроки(стр,ЭтоТаблица=Истина)
	
	decision = "";  	
	
	Если ЭтоТаблица И стр.func="" Тогда
		
		Источник = новый Структура("list,name,value,func,decision");
		Источник.list = Список;
		ЗаполнитьЗначенияСвойств(Источник,стр);
		// max
		Источник.func = "max";
		УстановитьУровеньПроблемыСтроки(Источник);
		// min
		Источник.func = "min";
		УстановитьУровеньПроблемыСтроки(Источник);
		стр.decision = Источник.decision;
		
		Возврат;
	
	КонецЕсли;
	
	//Ключ = стр.list+"->"+стр.name+"("+стр.func+")";
	//мОтбор = новый Структура("key",Ключ);
	//
	//н_строки = ТаблицаСуждений.НайтиСтроки(мОтбор);
	//
	//Если н_строки.Количество()=0 Тогда
	//	Возврат;
	//КонецЕсли;  	
	//
	//СтрокаСуждения = н_строки[0];
	//
	//Если СтрокаСуждения.invert=Ложь Тогда 
	//	Если стр.value>СтрокаСуждения.attention_from Тогда
	//		decision="красный";
	//	ИначеЕсли стр.value>СтрокаСуждения.warning_from Тогда
	//		decision="желтый";
	//	КонецЕсли;		
	//Иначе
	//	Если стр.value<СтрокаСуждения.attention_to Тогда
	//		decision="красный";
	//	ИначеЕсли стр.value<СтрокаСуждения.warning_to Тогда
	//		decision="желтый";
	//	КонецЕсли;		
	//КонецЕсли;
	//
	//Если стр.decision="" Тогда
	//	стр.decision = decision;
	//ИначеЕсли стр.decision="желтый" И decision="красный" Тогда
	//	стр.decision = decision;
	//КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицыДанных(Колонки,list)
	
	ИмяПоляУсловие = "";
	ИмяПоляОформление = "";
	ЭтоИстория = ""; // ?(Элементы.КартинкаИстория.Видимость,"история","");
	
	Для каждого стр из Колонки Цикл
	
		Если стр.Ключ="decision" Тогда
			
			ИмяПоляОформление = "ТаблицаДанных"+стр.ИмяКолонки;
			ИмяПоляУсловие = "ТаблицаДанных."+стр.ИмяКолонки;
			
			// желтый
			УстановитьОформлениеПоля("decision_желтый1_"+list+ЭтоИстория,"желтый", "ТаблицаДанных", ИмяПоляУсловие,WebЦвета.Золотой);
//			УстановитьОформлениеПоля("decision_желтый2_"+list+ЭтоИстория,"желтый", ИмяПоляОформление, ИмяПоляУсловие,WebЦвета.Желтый);
		
			// красное
			УстановитьОформлениеПоля("decision_красный1_"+list+ЭтоИстория,"красный", "ТаблицаДанных", ИмяПоляУсловие,WebЦвета.СветлоРозовый);
//			УстановитьОформлениеПоля("decision_красный2_"+list+ЭтоИстория,"красный", ИмяПоляОформление, ИмяПоляУсловие,WebЦвета.Розовый);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПоля(Знач Представление, Знач ЗначениеСравенения, Знач ИмяПоляОформление, Знач ИмяПоляУсловие,Знач ЦветФона)

	// проверим наличие офорления
	ЕстьОформление = Ложь;
	
	Для каждого стр из УсловноеОформление.Элементы Цикл
		Если стр.Представление=Представление Тогда
				ЕстьОформление = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОформление=Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = Представление;
	ЭлементОформления.Поля.Элементы.Очистить(); 
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляОформление);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляУсловие);// имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = ЗначениеСравенения;
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
	ЭлементОформления.Использование = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьНастройкиКолонокТекущегоСписка(Знач Колонки,Знач list)
	
	Перем мНастройка;
	Перем Ключ;
	// Получим настройки
	Ключ = Строка("МониторRAS.Форма");
	мНастройка = ПолучитьНастройки(Ключ, List);

	Если мНастройка=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Колонки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКолонки = мНастройка.Форма.Получить(list);
	
	Если НастройкиКолонки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКолонок = новый Соответствие();
	
	Для каждого стр из Колонки Цикл
		СоответствиеКолонок.Вставить(стр.Ключ,стр);
	КонецЦикла;
	
	Для каждого стр из НастройкиКолонки.Колонки Цикл
		Колонка = СоответствиеКолонок.Получить(стр.Ключ);
		Если Колонка=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Колонка.Видимость = стр.Видимость;
	КонецЦикла;
		
КонецПроцедуры  

&НаКлиенте
Функция СоставКолонокОдинаковый(Колонки1,Колонки2)
	
	КолонкиРавны = Истина;
	
	Если Колонки1.Количество()<>Колонки2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоответствиеКолонок1 = новый Соответствие();
	
	Для каждого стр из Колонки1 Цикл
		СоответствиеКолонок1.Вставить(стр.ИмяКолонки, стр);
	КонецЦикла;
		
	
	Для каждого стр из Колонки2 Цикл
		
		элем = СоответствиеКолонок1.Получить(стр.ИмяКолонки);
		
		Если элем=Неопределено Тогда
			КолонкиРавны = Ложь;
			Прервать;
		КонецЕсли;
		
		Если НЕ (элем.Заголовок=стр.Заголовок И элем.ТипСтрокой=стр.ТипСтрокой) Тогда
			КолонкиРавны = Ложь;
			Прервать;
		КонецЕсли;		
		
	КонецЦикла;

	
	Возврат КолонкиРавны;
	
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьТаблицуСвойств(Знач МассивСоответствиеДанных,Знач list)
	
	Перем стр, стр_н;
	
	ТаблицаСвойств.Очистить();
	
	Для каждого стр из МассивСоответствиеДанных Цикл
		Для каждого эл из стр Цикл
			Описание = СоответсвиеСинонимовСвойств.Получить(list+"/"+эл.Ключ);
			стр_н = ТаблицаСвойств.Добавить();
			стр_н.use = Истина;
			стр_н.name = эл.Ключ;
			стр_н.list = list; 
			стр_н.type = ?(Описание=Неопределено,ТипЗнч(эл.Значение),Описание.Тип); 
			стр_н.synonim = ?(Описание=Неопределено,"",Описание.Синоним);
		КонецЦикла;
		Прервать;
	КонецЦикла;
	
	// проставим флажки
	СоответствиеКолонок = новый Соответствие();
	
	Для каждого стр из СтарыеКолонки Цикл
		СоответствиеКолонок.Вставить(стр.Ключ,стр);
	КонецЦикла;
	
	Для каждого стр из ТаблицаСвойств Цикл
		Колонка = СоответствиеКолонок.Получить(стр.name);
		Если Колонка=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		стр.use = Колонка.Видимость;
	КонецЦикла;	
	

КонецПроцедуры

 &НаКлиенте
 Процедура СохранитьНастройкиКолонокТекущегоСписка(Знач list)
	Перем мНастройка;
	Перем Ключ;
	// Сохраним настройки
	Ключ = "МониторRAS.Форма";
	мНастройка = ПолучитьНастройки(Ключ, list);
	Если мНастройка=Неопределено Тогда
		мНастройка = новый Структура;
		мНастройка.Вставить("Форма",новый Соответствие);
	КонецЕсли;
	
	мНастройка.Форма.Вставить(list,новый Структура("Колонки",СтарыеКолонки));
	
	СохранитьНастройки(Ключ, list, мНастройка);
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройки(Ключ, list)
	Возврат	ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Ключ, list);
КонецФункции

&НаСервере
Процедура СохранитьНастройки(Ключ, list, мНастройка)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Ключ, list, мНастройка);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписок(мПараметры,list)
	
	ТекстОшибки = ""; 
	
	
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	
	ЗаполнитьДатуОбновления(КлючКластера, list); 
	МассивКластер = СтрРазделить(КлючКластера, ":", Ложь);
	Если МассивКластер.Количество() > 1 Тогда
		Сервер = МассивКластер[0]; 	                              
		Порт = МассивКластер[1];
		Если Интерактивно Тогда
			Если list = "ксСеансы" Тогда
				МодульRAC.ЗаполнитьТаблицуСеансовНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
			ИначеЕсли list = "ксПроцессы" Тогда
				МодульRAC.ЗаполнитьТаблицуПроцессовНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
			ИначеЕсли list = "ксСоединения" Тогда
				МодульRAC.ЗаполнитьТаблицуСоединенийНаСервере(СтрокаПлатформа,Сервер,СтрокаКластера,Порт);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	МассивСоответствиеДанных = Новый Массив;
	ЗаполнитьДатуОбновления(КлючКластера, list);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ Т.*
		|ИЗ
		|	&ТаблицаРС КАК Т
		|ГДЕ
		|	Т.ПериодЗаписи = &ПериодЗаписи
		|	И Т.Кластер = &Кластер";	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаРС", "РегистрСведений." + list); 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Кластер", КлючКластера);
	Запрос.УстановитьПараметр("ПериодЗаписи", ДатаОбновления); 
	РезЗапроса = Запрос.Выполнить();
	Выборка = РезЗапроса.Выбрать();  
	МассивКолонок = Новый Массив;
	Для Каждого Кол ИЗ РезЗапроса.Колонки Цикл
		МассивКолонок.Добавить(Кол);
	КонецЦикла;
	номерстроки = 1;  
	ИнфБазы = ИнформационныеБазы(КлючКластера);
	Пока Выборка.Следующий() Цикл
		СоответствиеДанных = Новый Соответствие;
		Для Каждого ИмяПараметра Из МассивКолонок Цикл
			Если ИмяПараметра.Имя = "infobase" Тогда
				ИмяБазы = ИнфБазы[Выборка[ИмяПараметра.Имя]];
				СоответствиеДанных.Вставить("infobase", ИмяБазы);
			Иначе
				СоответствиеДанных.Вставить(ИмяПараметра.Имя,Выборка[ИмяПараметра.Имя]);
			КонецЕсли;
		КонецЦикла;
		
		СоответствиеДанных.Вставить("line-number",номерстроки);
		МассивСоответствиеДанных.Добавить(СоответствиеДанных);

		номерстроки = номерстроки +1
	КонецЦикла;

	
	
			
	СтруктураДанныхОтвета = новый Структура();
	СтруктураДанныхОтвета.Вставить("МассивСоответствиеДанных",МассивСоответствиеДанных);
	
	Возврат СтруктураДанныхОтвета;
КонецФункции

Функция ИнформационныеБазы(Кластер)
	 СоответствиеДанных = Новый Соответствие; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксИнформационныеБазы.infobase КАК infobase,
		|	ксИнформационныеБазы.name КАК name
		|ИЗ
		|	РегистрСведений.ксИнформационныеБазы КАК ксИнформационныеБазы
		|ГДЕ
		|	ксИнформационныеБазы.Кластер = &Кластер";
	
	Запрос.УстановитьПараметр("Кластер", Кластер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеДанных.Вставить(ВыборкаДетальныеЗаписи.infobase, ВыборкаДетальныеЗаписи.name); 
	КонецЦикла;

	Возврат СоответствиеДанных;
КонецФункции

&НаКлиенте
Процедура ЗавершитьРаботуСенаса(Команда)
	
	
	ТекущиеДанныеКластеров = Элементы.ТаблицаКластеров.ТекущиеДанные; 
	МассивВыделенных = Новый Массив;
	Для Каждого Стр Из Элементы.ТаблицаДанных.ВыделенныеСтроки Цикл 
		МассивВыделенных.Добавить(Стр);
	КонецЦикла;
	Для Каждого ТекВыд Из МассивВыделенных Цикл
		Элементы.ТаблицаДанных.ТекущаяСтрока = ТекВыд;
		ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
		Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанныеКластеров=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если СтарыеКолонки=Неопределено Тогда
			СтарыеКолонки = новый Массив;
		КонецЕсли;		
		
		session = "";
		// найдем поле сессия
		Для каждого стр из СтарыеКолонки Цикл
			Если стр.Ключ="session" Тогда
				session = ТекущиеДанные[стр.Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если session="" Тогда
			Возврат;
		КонецЕсли;
		
		мПараметры = СформироватьСтруктуруЗапроса(ТекущиеДанныеКластеров);
		мПараметры.Вставить("session",session);
		СтруктураДанныхОтвета = ЗавершитьРаботуСенасаНаСервере(мПараметры); 
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьРаботуСенасаНаСервере(мПараметры)  
	Результат = "";
	Ковычка = Символ(34); 
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;			
	СтрокаПлатформа = Ковычка+ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКRAC")+Ковычка; 
	СтрокаКластера = Новый УникальныйИдентификатор(мПараметры.cluster); 
	МассивКластер = СтрРазделить(КлючКластера, ":", Ложь);  
	Если МассивКластер.Количество() > 1 Тогда
		Сервер = МассивКластер[0]; 	                              
		Порт = МассивКластер[1];	
		МодульRAC.ЗавершитьСеансНаСервере(СтрокаПлатформа,Сервер,Порт,СтрокаКластера,мПараметры.session,Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ПрименитьСоставПолей(Команда)
	ОбновитьВидимостьКолонок(Список);
	СохранитьНастройкиКолонокТекущегоСписка(Список);
КонецПроцедуры    

&НаКлиенте
Процедура ОбновитьВидимостьКолонок(list)
	
	СоответствиеКолонок = новый Соответствие();
	
	Для каждого стр из СтарыеКолонки Цикл
		СоответствиеКолонок.Вставить(стр.Ключ,стр);
	КонецЦикла;
	
	ВидимыхПолей = 0;
	
	Для каждого стр из ТаблицаСвойств Цикл
		
		СвойстваКолонки = СоответствиеКолонок.Получить(стр.name);
		Если СвойстваКолонки=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = Элементы.Найти("ТаблицаДанных"+СвойстваКолонки.ИмяКолонки);
		
		Если Элемент=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Элемент.Видимость=стр.use Тогда
			Элемент.Видимость = стр.use;
			СвойстваКолонки.Видимость = стр.use;
		КонецЕсли;
		
		Если Элемент.Видимость=Истина Тогда
			ВидимыхПолей=ВидимыхПолей+1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВидимыхПолей=0 Тогда
		Сообщить("Вы убрали все поля. Оставьте хотябы одно поле!");
	КонецЕсли;
	
КонецПроцедуры
